_Rarzrabotki/Rarus/USO2/Documents/УСОERP_БазаРаспределенияНакладныхРасходов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>УСОERP_БазаРаспределенияНакладныхРасходов</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.УСОERP_БазаРаспределенияПлановыхНакладныхРасходов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОбъектСтроительства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_ОбъектыСтроительства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СценарийПланирования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УСОERP_СценарииПланированияПроектовСтроительства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяРасходов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыФинансовогоУчетаДоходовРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УСОERP_УтверждениеКалендарногоПланаГрафика</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОбъектыРасценки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Отметка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидРаспределения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.УСОERP_ТипыЗатратДляРасценкиПроекта</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Работа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УСОERP_СтроительныеРаботы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ресурс</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УСОERP_Ресурсы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъектРасценки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
								<v8:Type>cfg:CatalogRef.Должности</v8:Type>
								<v8:Type>cfg:CatalogRef.УСОERP_Ресурсы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Documents/УСОERP_УтверждениеКалендарногоПланаГрафика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>УСОERP_УтверждениеКалендарногоПланаГрафика</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаВерсииПлана</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектСтроительства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_ОбъектыСтроительства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСтатус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УСОERP_СтатусыУтвержденияКалендарногоПланаГрафика</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СценарийПланирования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УСОERP_СценарииПланированияПроектовСтроительства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПланов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Актуальный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КопияСценария</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УСОERP_СценарииПланированияПроектовСтроительства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Работы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Работа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УСОERP_СтроительныеРаботы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъемРаботы</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаОбъема</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачалоРаботыПлан</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОкончаниеРаботыПлан</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДлительностьПлан</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаДлительности</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ЕдиницыИзмеренияВремени</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммарнаяРабота</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Родитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УСОERP_СтроительныеРаботы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Documents/УСОERP_БазаРаспределенияНакладныхРасходов/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Перем КэшированныеЗначения; //используется механизмом обработки изменения реквизитов ТЧ

&НаКлиенте
Перем ПредыдущиеРеквизитыСтроки; //используется для отвязки строки поступления от строки заказа

&НаКлиенте
Перем ТекущиеДанныеИдентификатор; //используется для передачи текущей строки в обработчик ожидания

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;

	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства
		
	// Обработчик механизма "ВерсионированиеОбъектов"
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма); 	
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		ПриЧтенииСозданииНаСервере();
		
	КонецЕсли;
	
	НовыйВариант = Объект.ДокументОснование.СценарийПланирования.НовыйВариант = Истина;
	
	СформироватьЗаполнитьДеревоРабот(Истина);

	ТекущийОбъектСтроительства 	 = Объект.ОбъектСтроительства;
	ТекущийСценарий 			 = Объект.СценарийПланирования;
	ТекущийПланПроизводстваРабот = Объект.ДокументОснование;
	ТекущаяОрганизация           = Объект.Организация;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды  
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// Обработчик механизма "ДатыЗапретаИзменения"
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	
	ПриЧтенииСозданииНаСервере();
	
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);

	МодификацияКонфигурацииПереопределяемый.ПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ИсточникВыбора.ИмяФормы =	"Справочник.УСОERP_СтроительныеРаботы.Форма.ФормаВыбора" Тогда
		
		ОбработатьПодборРаботНаСервере( ВыбранноеЗначение);
	
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтаФорма, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	СохранитьИзмененияБазыРаспределения(ТекущийОбъект);
	
	// Обработчик подсистемы "Свойства"
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтаФорма, ТекущийОбъект);
		
	//Элементы.ГруппаКомментарий.Картинка = ОбщегоНазначения.ПолучитьКартинкуКомментария(Объект.Комментарий);

	МодификацияКонфигурацииПереопределяемый.ПередЗаписьюНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи);

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("Запись_НазначениеИсполнителейРабот", ПараметрыЗаписи, Объект.Ссылка);

	МодификацияКонфигурацииКлиентПереопределяемый.ПослеЗаписи(ЭтаФорма, ПараметрыЗаписи);

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	//Элементы.ГруппаКомментарий.Картинка = ОбщегоНазначения.ПолучитьКартинкуКомментария(Объект.Комментарий);
	
	МодификацияКонфигурацииПереопределяемый.ПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОбъектСтроительстваПриИзменении(Элемент)
	
	РабочийСценарий = УСОERP_УправлениеСтроительнымПроизводством.ПолучитьРабочийСценарий(Объект.ОбъектСтроительства, Объект.Организация);
	
	СтруктураПараметров = Новый Структура("РабочийСценарий",РабочийСценарий);
	
	Если ЗначениеЗаполнено(ТекущийОбъектСтроительства)
		И ДеревоРабот.ПолучитьЭлементы().Количество() > 0 Тогда
		
		Если ТекущийОбъектСтроительства <> Объект.ОбъектСтроительства Тогда
			
			ПоказатьВопрос(Новый ОписаниеОповещения("ОбъектСтроительстваПриИзмененииПродолжение",ЭтотОбъект,СтруктураПараметров),"Дерево работ будет очищено. Продолжить?", РежимДиалогаВопрос.ДаНет, 20, КодВозвратаДиалога.Нет);
			
		КонецЕсли;
		
	Иначе 
		
		ОбъектСтроительстваПриИзмененииПродолжение(КодВозвратаДиалога.Да,СтруктураПараметров);		
		
	КонецЕсли; 	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектСтроительстваПриИзмененииПродолжение(Ответ,ДопПараметры)Экспорт  	
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Объект.ОбъектСтроительства = ТекущийОбъектСтроительства;
		Объект.Организация         = ТекущаяОрганизация;
		Возврат;
	КонецЕсли;
	
	РабочийСценарий = ДопПараметры.РабочийСценарий;
	
	Если    ТекущийОбъектСтроительства <> Объект.ОбъектСтроительства 
		Или ТекущаяОрганизация <> Объект.Организация                  Тогда
		ДеревоРабот.ПолучитьЭлементы().Очистить();
		Объект.СценарийПланирования = РабочийСценарий;
		ТекущийСценарий = Объект.СценарийПланирования;
		Объект.ДокументОснование = "";
		Объект.НаправлениеДеятельности = "";
		Объект.ДокументОснование = УСОERP_ЗащищенныеФункцииСервер.ПолучитьПоследнийДокументУтверждения(Объект.ОбъектСтроительства,Объект.Организация);
        ДокументОснованиеПриИзмененииПродолжение(КодВозвратаДиалога.Да,Новый Структура);
	КонецЕсли;
	
	ТекущийОбъектСтроительства = Объект.ОбъектСтроительства;
	ТекущаяОрганизация         = Объект.Организация;  	
	
КонецПроцедуры    

&НаКлиенте
Процедура ДокументОснованиеПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(ТекущийПланПроизводстваРабот)
		И ТекущийПланПроизводстваРабот <> Объект.ДокументОснование 
		И ДеревоРабот.ПолучитьЭлементы().Количество() > 0 Тогда
		
		ПоказатьВопрос(Новый ОписаниеОповещения("ДокументОснованиеПриИзмененииПродолжение",ЭтотОбъект),"Дерево работ будет очищено. Продолжить?", РежимДиалогаВопрос.ДаНет, 20, КодВозвратаДиалога.Нет);
		
	Иначе
		
		ДокументОснованиеПриИзмененииПродолжение(КодВозвратаДиалога.Да,Новый Структура);
		
	КонецЕсли; 	
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументОснованиеПриИзмененииПродолжение(Ответ,ДопПараметры)Экспорт
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Объект.ДокументОснование = ТекущийПланПроизводстваРабот;
		Возврат;
	КонецЕсли;
	
	ДеревоРабот.ПолучитьЭлементы().Очистить();
	ТекущийПланПроизводстваРабот = Объект.ДокументОснование;
	ДокументОснованиеПриИзмененииНаСервере(); 
	
КонецПроцедуры

&НаКлиенте
Процедура СценарийПланированияПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(ТекущийСценарий)
		И ТекущийСценарий <> Объект.СценарийПланирования 
		И ДеревоРабот.ПолучитьЭлементы().Количество() > 0 Тогда
		
		ПоказатьВопрос(Новый ОписаниеОповещения("СценарийПланированияПриИзмененииПродолжение",ЭтотОбъект),"Дерево работ будет очищено. Продолжить?", РежимДиалогаВопрос.ДаНет, 20, КодВозвратаДиалога.Нет);
		
	Иначе
		
		СценарийПланированияПриИзмененииПродолжение(КодВозвратаДиалога.Да,Новый Структура);	
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СценарийПланированияПриИзмененииПродолжение(Ответ,ДопПараметры)Экспорт
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Объект.СценарийПланирования = ТекущийСценарий;
		Возврат;
	КонецЕсли;
	
	ДеревоРабот.ПолучитьЭлементы().Очистить();
	ТекущийСценарий = Объект.СценарийПланирования;
	
КонецПроцедуры  

#КонецОбласти

#Область ОбработчикиСобытийЭлементовДереваФормыДеревоРабот

#КонецОбласти  

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Элементы.Список, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект,Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура Подключаемый_ВыполнитьПереопределяемуюКоманду(Команда)
	
	СобытияФормКлиент.ВыполнитьПереопределяемуюКоманду(ЭтаФорма, Команда);
	
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.ОбъектСтроительства) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указан объект строительства. Заполнение невозможно.", Объект.Ссылка, "ОбъектСтроительства", "Объект");
		Возврат;
	Конецесли;

	Если Не ЗначениеЗаполнено(Объект.СценарийПланирования) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указан сценарий планирования. Заполнение невозможно.", Объект.Ссылка, "СценарийПланирования", "Объект");
		Возврат;
	Конецесли;

	Если Не ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указан внутренний план производства работ. Заполнение невозможно.", Объект.Ссылка, "ДокументОснование", "Объект");
		Возврат;
	Конецесли;
	
	Если ДеревоРабот.ПолучитьЭлементы().Количество() > 0 Тогда
		
		ПоказатьВопрос(Новый ОписаниеОповещения("ЗаполнитьПродолжение",ЭтотОбъект),"Дерево работ будет очищено перед заполнением. Продолжить?", РежимДиалогаВопрос.ДаНет, 20, КодВозвратаДиалога.Нет);
		
	Иначе
		
		ЗаполнитьПродолжение(КодВозвратаДиалога.Да,Новый Структура);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПродолжение(Ответ,ДопПараметры) Экспорт
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	СтрокиДереваРабот = ДеревоРабот.ПолучитьЭлементы();
	СтрокиДереваРабот.Очистить();
	
	СформироватьЗаполнитьДеревоРабот();
	
	//РазвернутьНаКлиенте();
	
КонецПроцедуры  

&НаКлиенте
Процедура Подбор(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.ОбъектСтроительства) Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указан объект строительства. Заполнение невозможно.", Объект.Ссылка, "ОбъектСтроительства", "Объект");
		Возврат;
		
	Конецесли;

	Если Не ЗначениеЗаполнено(Объект.СценарийПланирования) Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указан сценарий планирования. Заполнение невозможно.", Объект.Ссылка, "СценарийПланирования", "Объект");
		Возврат;
		
	Конецесли;

	Если Не ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указан внутренний план производства работ. Заполнение невозможно.", Объект.Ссылка, "ДокументОснование", "Объект");
		Возврат;
		
	Конецесли;
	
	Если НовыйВариант Тогда
		
		СтруктураОтбора = Новый Структура("ДокументУтверждения,МножественныйВыбор",Объект.ДокументОснование,Истина);
		
	Иначе
		
		СтруктураОтбора = Новый Структура("Организация, ОбъектСтроительства, СценарийПланирования, Утверждена", Объект.Организация, Объект.ОбъектСтроительства, Объект.СценарийПланирования, Истина);
		
	КонецЕсли;
	
	ОткрытьФорму("Справочник.УСОERP_СтроительныеРаботы.ФормаВыбора",СтруктураОтбора, ЭтаФорма,,,,,);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВсе(Команда)
	
	УстановитьСнятьОтметкиНаКлиентеРекурсивно(ДеревоРабот,Истина);   
	Модифицированность = Истина;
	ЗаполнитьДанныеОбъектаИзФормы();
	
КонецПроцедуры 

&НаКлиенте
Процедура УстановитьСнятьОтметкиНаКлиентеРекурсивно(СтрокаДерева,Отметка)
	
	Для Каждого ПодСтрока ИЗ СтрокаДерева.ПолучитьЭлементы() Цикл
		
		Если НЕ ПодСтрока.СуммарнаяРабота Тогда
			ПодСтрока.Отметка = Отметка;
			Продолжить;
		КонецЕсли;
		
		УстановитьСнятьОтметкиНаКлиентеРекурсивно(ПодСтрока,Отметка);	
		
	КонецЦикла; 	
	
КонецПроцедуры 

&НаКлиенте
Процедура СнятьВсе(Команда)
	
	УстановитьСнятьОтметкиНаКлиентеРекурсивно(ДеревоРабот,Ложь);	
	Модифицированность = Истина;
	ЗаполнитьДанныеОбъектаИзФормы(); 
	
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьВсе(Команда)
	
	РазвернутьНаКлиенте();
	
КонецПроцедуры

&НаКлиенте
Процедура СвернутьВсе(Команда)
	
	СвернутьНаКлиенте();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()

	УсловноеОформление.Элементы.Очистить();

	//
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоРабот.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоРабот.СуммарнаяРабота");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;

	Элемент.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(WindowsШрифты.ШрифтДиалоговИМеню,,,Истина));
	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр",Истина);
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветаСтиля.ЦветФонаГруппировкиОтчета2);

		
	//
	
	Элемент = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ДеревоРабот.Имя);

	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоРабот.Отметка");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;

	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветаСтиля.ЦветФонаПолностьюОбеспечен);

	//
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
		
КонецПроцедуры	

#КонецОбласти

#Область Прочее

&НаСервере
Процедура СформироватьЗаполнитьДеревоРабот(ЧтениеИзТабличнойЧасти = Ложь)
	
	Если НовыйВариант Тогда
		СформироватьЗаполнитьДеревоРаботНовыйВариант(ЧтениеИзТабличнойЧасти);
		Возврат;
	КонецЕсли;
	
	
	УСОERP_ЗащищенныеФункцииСервер.УСОERP_БазаРаспределенияНакладныхРасходов_СформироватьЗаполнитьДеревоРабот(ЭтотОбъект, ЧтениеИзТабличнойЧасти);
	
КонецПроцедуры

&НаСервере
Процедура СформироватьЗаполнитьДеревоРаботНовыйВариант(ЧтениеИзТабличнойЧасти)
	
	ТабРабот = Объект.ОбъектыРасценки.Выгрузить();
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("ТабРабот",ТабРабот);
	Запрос.УстановитьПараметр("КопияСценария",Объект.ДокументОснование.КопияСценария);
	Запрос.УстановитьПараметр("ЧтениеИзТабличнойЧасти",ЧтениеИзТабличнойЧасти);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ТабРабот.Работа КАК Справочник.УСОERP_СтроительныеРаботы) КАК Работа,
	|	ТабРабот.Отметка КАК Отметка
	|ПОМЕСТИТЬ ВрТабРабот
	|ИЗ
	|	&ТабРабот КАК ТабРабот
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВрТабРабот.Работа КАК Работа,
	|	ВрТабРабот.Отметка КАК Отметка
	|ПОМЕСТИТЬ ТабРаботы
	|ИЗ
	|	ВрТабРабот КАК ВрТабРабот
	|ГДЕ
	|	&ЧтениеИзТабличнойЧасти
	|	И НЕ ВрТабРабот.Работа.СуммарнаяРабота
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	УСОERP_СтроительныеРаботы.Ссылка,
	|	ЛОЖЬ
	|ИЗ
	|	Справочник.УСОERP_СтроительныеРаботы КАК УСОERP_СтроительныеРаботы
	|ГДЕ
	|	УСОERP_СтроительныеРаботы.Владелец = &КопияСценария
	|	И НЕ УСОERP_СтроительныеРаботы.ПометкаУдаления
	|	И НЕ УСОERP_СтроительныеРаботы.СуммарнаяРабота
	|	И &ЧтениеИзТабличнойЧасти = ЛОЖЬ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТабРаботы.Работа КАК Работа,
	|	ТабРаботы.Отметка КАК Отметка
	|ИЗ
	|	ТабРаботы КАК ТабРаботы
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТабРаботы.Работа.ПорядокСортировки,
	|	ТабРаботы.Работа.НомерРаботыВУровне
	|ИТОГИ
	|	МАКСИМУМ(Отметка)
	|ПО
	|	Работа ИЕРАРХИЯ";  	
	
	ДеревоЗапроса = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	
	ДеревоРаботы = РеквизитФормыВЗначение("ДеревоРабот");
	
	ДеревоРаботы.Строки.Очистить();
	
	Для Каждого СтрокаЗапроса ИЗ ДеревоЗапроса.Строки Цикл
		
		ВывестиДеревоРаботИзДереваЗапроса(СтрокаЗапроса,ДеревоРаботы);
		
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(ДеревоРаботы,"ДеревоРабот");	
	
КонецПроцедуры

Процедура ВывестиДеревоРаботИзДереваЗапроса(СтрокаЗапроса,ДеревоРаботы)
	
	Нстр = ДеревоРаботы.Строки.Добавить();
	Нстр.Работа = СтрокаЗапроса.Работа;
	Нстр.СуммарнаяРабота = СтрокаЗапроса.Работа.СуммарнаяРабота;
	Нстр.Отметка = СтрокаЗапроса.Отметка*(НЕ Нстр.СуммарнаяРабота);
	
	Для Каждого ПодСтрока ИЗ СтрокаЗапроса.Строки Цикл
		
		Если ПодСтрока.Работа = СтрокаЗапроса.Работа Тогда
			Продолжить;
		КонецЕсли;
		
		ВывестиДеревоРаботИзДереваЗапроса(ПодСтрока,Нстр);
		
	КонецЦикла; 
	
КонецПроцедуры  

&НаСервере
Процедура СохранитьИзмененияБазыРаспределения(ТекущийОбъект)
	
	ТекущийОбъект.ОбъектыРасценки.Очистить();
		
	ПрочитатьДанныеИзДереваРабот(ТекущийОбъект, );
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьДанныеИзДереваРабот(ТекущийОбъект, СтрокаДерева = Неопределено)
	
	Если СтрокаДерева = Неопределено Тогда
		мДеревоРабот = РеквизитФормыВЗначение("ДеревоРабот", Тип("ДеревоЗначений"));
		СтрокиДереваРабот = мДеревоРабот.Строки;
	Иначе
		СтрокиДереваРабот = СтрокаДерева.Строки;
	КонецЕсли;
	
	Для Каждого СтрокаДерева Из СтрокиДереваРабот Цикл
		
		Если НовыйВариант Тогда
			
			Если НЕ СтрокаДерева.Работа.СуммарнаяРабота Тогда
				
				НоваяСтрокаТЧ = ТекущийОбъект.ОбъектыРасценки.Добавить();
				ЗаполнитьЗначенияСвойств( НоваяСтрокаТЧ, СтрокаДерева);
				
			КонецЕсли;
			
		Иначе
			
			НоваяСтрокаТЧ = ТекущийОбъект.ОбъектыРасценки.Добавить();
			ЗаполнитьЗначенияСвойств( НоваяСтрокаТЧ, СтрокаДерева);
			
		КонецЕсли;
		
		Если СтрокаДерева.Строки.количество()>0 Тогда
			ПрочитатьДанныеИзДереваРабот(ТекущийОбъект, СтрокаДерева);
		КонецЕсли;
		
	КонецЦикла; 	
	
КонецПроцедуры  

&НаСервере
Функция ПолучитьСписокРабот()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	УСОERP_УтверждениеКалендарногоПланаГрафикаРаботы.Работа
	|ИЗ
	|	Документ.УСОERP_УтверждениеКалендарногоПланаГрафика.Работы КАК УСОERP_УтверждениеКалендарногоПланаГрафикаРаботы
	|ГДЕ
	|	УСОERP_УтверждениеКалендарногоПланаГрафикаРаботы.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Объект.ДокументОснование);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат.ВыгрузитьКолонку("Работа");
	
КонецФункции

&НаКлиенте
Процедура СвернутьНаКлиенте(мТекущаяСтрока = Неопределено)
	
	Если мТекущаяСтрока = Неопределено Тогда
		КоллекцияЭлементовДерева = ДеревоРабот.ПолучитьЭлементы();
	Иначе
		КоллекцияЭлементовДерева = мТекущаяСтрока.ПолучитьЭлементы();
	КонецЕсли;
	 	
	Для Каждого Строка Из КоллекцияЭлементовДерева Цикл
		
		ИдентификаторСтроки	= Строка.ПолучитьИдентификатор();
		Элементы.ДеревоРабот.Свернуть(ИдентификаторСтроки);
		
	КонецЦикла;	

КонецПроцедуры

&НаКлиенте
Процедура РазвернутьНаКлиенте(мТекущаяСтрока = Неопределено)
	
	Если мТекущаяСтрока = Неопределено Тогда
		КоллекцияЭлементовДерева = ДеревоРабот.ПолучитьЭлементы();
	Иначе
		КоллекцияЭлементовДерева = мТекущаяСтрока.ПолучитьЭлементы();
	КонецЕсли;  
	
	Для Каждого Строка Из КоллекцияЭлементовДерева Цикл
		
		ИдентификаторСтроки	= Строка.ПолучитьИдентификатор();
		Элементы.ДеревоРабот.Развернуть(ИдентификаторСтроки);
		
		Если Строка.ПолучитьЭлементы().количество()>0 Тогда
			РазвернутьНаКлиенте(Строка);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьПодборРаботНаСервере( ВыбранноеЗначение)
	
	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;
	
	Если НовыйВариант Тогда
		ОбработатьПодборРаботНовыйВариант(ВыбранноеЗначение);
		Возврат;
	КонецЕсли;
		
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Массив") Тогда 
		
		мДеревоРабот = РеквизитФормыВЗначение("ДеревоРабот", Тип("ДеревоЗначений"));
		
		Для Каждого Элем из ВыбранноеЗначение Цикл
			
			Если мДеревоРабот.Строки.найти(Элем, , Истина) = Неопределено 
				И НЕ Элем.СуммарнаяРабота Тогда
				НоваяСтрока = мДеревоРабот.Строки.Добавить();
				НоваяСтрока.Работа = Элем;
				НоваяСтрока.СуммарнаяРабота = Элем.СуммарнаяРабота;
			КонецЕсли;
			
		КонецЦикла;	
		
		ЗначениеВРеквизитФормы(мДеревоРабот, "ДеревоРабот");
		
	ИначеЕсли ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.УСОERP_СтроительныеРаботы") Тогда
		
		Если ВыбранноеЗначение.СуммарнаяРабота Тогда
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Выбор этапа в данном случае не предусмотрен! Необходимо выбрать конкретную работу.'")
			+ Символы.ПС + ОписаниеОшибки());
			Возврат;
			
		КонецЕсли;
		
		мДеревоРабот = РеквизитФормыВЗначение("ДеревоРабот", Тип("ДеревоЗначений")); 		
		
		Если мДеревоРабот.Строки.найти(ВыбранноеЗначение, , Истина) = Неопределено Тогда
			НоваяСтрока = мДеревоРабот.Строки.Добавить();
			НоваяСтрока.Работа = ВыбранноеЗначение;
			НоваяСтрока.СуммарнаяРабота = ВыбранноеЗначение.СуммарнаяРабота;
		КонецЕсли;
		
		ЗначениеВРеквизитФормы(мДеревоРабот, "ДеревоРабот");
		
	Иначе
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Выбор этапа в данном случае не предусмотрен! Необходимо выбрать конкретную работу.'")
		+ Символы.ПС + ОписаниеОшибки());
		
	КонецЕсли;   
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьПодборРаботНовыйВариант(ВыбранноеЗначение)
	
	Объект.ОбъектыРасценки.Очистить();
	
	ПрочитатьДанныеИзДереваРабот(Объект);
	
	ДеревоРабот.ПолучитьЭлементы().Очистить();     	
	
	Запрос = Новый Запрос ;
	Запрос.УстановитьПараметр("МассивРабот",ВыбранноеЗначение);
	Запрос.УстановитьПараметр("КопияСценария",Объект.ДокументОснование.КопияСценария);
	Запрос.УстановитьПараметр("МассивСуществующихРабот",Объект.ОбъектыРасценки.Выгрузить().ВыгрузитьКолонку("Работа"));
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	УСОERP_СтроительныеРаботы.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.УСОERP_СтроительныеРаботы КАК УСОERP_СтроительныеРаботы
	|ГДЕ
	|	НЕ УСОERP_СтроительныеРаботы.ПометкаУдаления
	|	И УСОERP_СтроительныеРаботы.Ссылка В ИЕРАРХИИ(&МассивРабот)
	|	И НЕ УСОERP_СтроительныеРаботы.СуммарнаяРабота
	|	И УСОERP_СтроительныеРаботы.Владелец = &КопияСценария
	|	И НЕ УСОERP_СтроительныеРаботы.Ссылка В (&МассивСуществующихРабот)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Нстр = Объект.ОбъектыРасценки.Добавить();
		Нстр.Работа = Выборка.ссылка;
		
	КонецЦикла;
	
	СформироватьЗаполнитьДеревоРабот(Истина);
	
	Модифицированность = Истина;

КонецПроцедуры    

&НаСервере
Процедура ДокументОснованиеПриИзмененииНаСервере()
	
	Объект.СценарийПланирования = Объект.ДокументОснование.СценарийПланирования;
	Объект.НаправлениеДеятельности = Объект.ДокументОснование.НаправлениеДеятельности;
	НовыйВариант = Объект.СценарийПланирования.НовыйВариант;
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументОснованиеОчистка(Элемент, СтандартнаяОбработка)
	ДокументОснованиеПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	РабочийСценарий = УСОERP_УправлениеСтроительнымПроизводством.ПолучитьРабочийСценарий(Объект.ОбъектСтроительства, Объект.Организация);
	
	СтруктураПараметров = Новый Структура("РабочийСценарий",РабочийСценарий); 	
	
	Если Объект.Организация <> ТекущаяОрганизация И ЗначениеЗаполнено(Объект.Организация) И ЗначениеЗаполнено(Объект.ОбъектСтроительства) И ДеревоРабот.ПолучитьЭлементы().Количество() Тогда
		
		ПоказатьВопрос(Новый ОписаниеОповещения("ОбъектСтроительстваПриИзмененииПродолжение",ЭтотОбъект,СтруктураПараметров),"Дерево работ будет очищено. Продолжить?", РежимДиалогаВопрос.ДаНет, 20, КодВозвратаДиалога.Нет);
		
	Иначе
		
		Объект.СценарийПланирования = РабочийСценарий;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
		// СтандартныеПодсистемы.Свойства 
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства

КонецПроцедуры

&НаКлиенте
Процедура ДеревоРаботПередУдалением(Элемент, Отказ)
	
	ТекСтрока = Элементы.ДеревоРабот.ТекущиеДанные;
	
	ТекСтрокаУдаления = ТекСтрока;
	
	Пока Истина Цикл
		
		Родитель = ТекСтрокаУдаления.ПолучитьРодителя(); 
		
		Если Родитель = Неопределено Тогда
			Прервать;
		КонецЕсли;
		
		
		Если Родитель.ПолучитьЭлементы().Количество() > 1 Тогда
			
			Прервать;
			
		КонецЕсли;
		
		ТекСтрокаУдаления = Родитель;
		
	КонецЦикла;  	
	
	Если ТекСтрока.ПолучитьИдентификатор() <> ТекСтрокаУдаления.ПолучитьИдентификатор() Тогда    		
		
		Родитель = ?(ТекСтрокаУдаления.ПолучитьРодителя() = Неопределено,ДеревоРабот,ТекСтрокаУдаления.ПолучитьРодителя());
		
		Родитель.ПолучитьЭлементы().Удалить(ТекСтрокаУдаления);
		
	КонецЕсли;  	
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоРаботПослеУдаления(Элемент) 	
	
	ЗаполнитьДанныеОбъектаИзФормы();
	
	Модифицированность = Истина;  		
	
КонецПроцедуры   

&НаСервере
Процедура ЗаполнитьДанныеОбъектаИзФормы()
	
	Если НЕ НовыйВариант Тогда
		Возврат;
	КонецЕсли;
	
	Объект.ОбъектыРасценки.Очистить();
	ДеревоДанных = РеквизитФормыВЗначение("ДеревоРабот");
	
	Строки = ДеревоДанных.Строки.НайтиСтроки(Новый Структура("СуммарнаяРабота",Ложь),Истина);
	
	Для Каждого НайденнаяСтрока ИЗ Строки Цикл
		ЗаполнитьЗначенияСвойств(Объект.ОбъектыРасценки.Добавить(),НайденнаяСтрока);
	КонецЦикла;
	
КонецПроцедуры  

&НаКлиенте
Процедура ДеревоРаботПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	ЗаполнитьДанныеОбъектаИзФормы();
	Модифицированность = Истина;
	
КонецПроцедуры

// СтандартныеПодсистемы.Свойства 
&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()

	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);

КонецПроцедуры

// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры

// Конец СтандартныеПодсистемы.Свойства  

#КонецОбласти
